import { type MapPoint, Route } from "@/types";
import { historyIcon, interestingIcon, militaryIcon } from "@assets/icons";
import { POINTS_IMAGES } from "@assets/images";

const HISTORICAL_POINTS: MapPoint[] = [
  {
    lng: 29.9183,
    lat: 50.640463,
    title: "«Круг» та Варшавка",
    route: Route.HISTORICAL,
    desc:
      "1 – фото колишнього ресторану “У Саші”\n" +
      "2 – фото колишнього автовокзалу, з почкою зверху “Борекс”\n" +
      "3 – фото району з висоти \n" +
      "4 – фото стели на вʼїзді \n\n" +
      "Для нас «Круг» — це звична розв’язка, але з’явилася вона лише у 60-х роках разом із новою трасою на Київ. До цього в столицю їхали або потягом, або старою дорогою зовсім в іншому напрямку.\n\n" +
      "Поява «Варшавки» (так її прозвали в народі) буквально «підірвала» життя селища. Бородянка стала відкритою для світу: прямий шлях на Київ, Ірпінь та навіть на Польщу. Це місце стало головними воротами громади.\n\n" +
      "Що було поруч:\n\n" +
      "Тут пульсував автовокзал — місце зустрічей та прощань. Пізніше на його місці відкрили СТО, а там, де зараз руїни ресторану «У Саші», колись стояв пост ДАІ (Дорожня автомобільна інспекція).\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Колись тут була пуста околиця. Але траса та завод запустили стрімку урбанізацію. До речі, пост ДАІ водії жартома називали «шоферові сльози» через суворі перевірки. А там, де зараз стоїть наш журавель, раніше гордо височів трактор — символ заводу «БОРЕКС», який колись був гігантом і філією київського «Червоного екскаватора».",
    address: "В’їзд у Бородянку, траса М-07",
  },

  {
    lng: 29.92022,
    lat: 50.640817,
    title: "Перша «двоповерхівка»",
    route: Route.HISTORICAL,
    desc:
      "Район почав оживати після 1960-х. Саме цей будинок став першим багатоквартирним «велетнем» у Бородянці на два поверхи. Здавалося б — дрібниця, але для того часу це був символ того, що село стає містечком. Це була наша точка неповернення до міського стилю життя.\n\n" +
      "Що було поруч:\n\n" +
      "Зовсім поруч знаходилася легендарна «Ракова яма».\n\n" +
      "Значення / цікавий факт:\n\n" +
      "«Ракова яма» отримала назву від прізвища місцевого мешканця — Рака. Це був невеликий кар’єр, де брали пісок та глину. Хоч зараз там стоїть п’ятиповерхівка (Центральна, 334), колись тут була водойма, яка ніколи не пересихала. Влітку там плавали гуси, а взимку дітлахи з усього району зліталися сюди кататися на санчатах.\n",
    address: "Вулиця Центральна, 336",
  },

  {
    lng: 29.93166,
    lat: 50.643061,
    title: "Ставок та приказка",
    route: Route.HISTORICAL,
    desc:
      "1,2 – сучасний вигляд ставків \n" +
      "3,4 – старе фото річки Рудка + в кольорі \n" +
      "5,6 – фото млина + в кольорі, до наших днів не вцілів \n" +
      "7,8 – фото Водохреща на річці Здвиж + в кольорі, далі за Рудкою \n\n" +
      "Ставки в центрі — це те, чому багато міст могли б нам позаздрити. Це не просто технічні водойми, а справжнє серце Бородянки. Тут протікає річка Рудка, і якщо пройти трохи вгору за течією, до каплички на Парковій, можна побачити її справжній, природний вигляд. \n\n" +
      "Але головні господарі тут — жаби. Влітку їхній хор чути в кожному куточку селища. Місцеві знають: якщо ввечері жаби влаштовують особливо гучний «концерт», точно буде дощ. Окрім них, тут живуть черепахи та повно риби, що робить ставки живою оазою посеред квартирної забудови.\n\n" +
      "Що було поруч:\n\n" +
      "Трохи нижче за течією колись стояв старий млин — там мололи борошно на все селище. Він був навпроти сучасного майданчика-корабля, ближче до теперішніх гаражів.\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Ставки викопали вручну, щоб підсушити болотисту місцевість. А ще з цим місцем пов'язана забута приказка: «Холодно, як на Бородянському мосту». Через вітри тут завжди пробирало до кісток. Цікаво, що в Бородянці вислів майже зник, а от у Сибіру його досі пам’ятають, куди доля певно закинула наших земляків. І не забудьте: колись далі за течією, де Рудка впадає у Здвиж, усе селище збиралося на Водохреще — у нас навіть збереглися старі фото тих часів.\n",
    address: "Центр Бородянки, ставки та парк “Рудка",
  },
  {
    lng: 29.933328,
    lat: 50.643641,
    title: "Торгове серце Бородянки",
    route: Route.HISTORICAL,
    desc:
      "1,2,3 – сучасний вигляд площі Т. Г. Шевченка \n" +
      "4,5 – фото вулиці де ймовірно був шинок “Голубий Дунай” + в кольорі \n\n" +
      "Там, де зараз стоїть Палац культури, колись шумів величезний базар. Це було місце, де новини поширювалися швидше за інтернет. Купці, ремісники, селяни з усіх усюд з’їжджалися сюди щодня.\n\n" +
      "Що було поруч:\n\n" +
      "Вулиця Велика (колись Коблицька дорога). Місцеві називали її так, бо вона вела до Коблиці, а за легендами — аж до самого Чорнобиля, який був великим торговельним центром того часу.\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Поруч працював відомий шинок «Голубий Дунай». Назву швидко скоротили до просто «Голубий», а постійних відвідувачів, які виходили звідти «на підпитку», жартома називали голубими. Отакий місцевий гумор!\n",
    address: "Площа Т. Г. Шевченка",
  },
  {
    lng: 29.934024,
    lat: 50.644386,
    title: "Перші «хмарочоси» та амбіції",
    route: Route.HISTORICAL,
    desc:
      "1,2 – старе фото перших 9-ти поверхівок\n\n" +
      "Висотна історія Бородянки почалася саме тут. Цікаво, що спочатку планували звичайні п’ятиповерхівки, але амбіції взяли гору — і ми отримали повноцінні 9-поверхові будинки. Для невеликого селища це був справжній прорив.\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Кажуть, що ці будинки з’явилися завдяки зв’язкам нашого заводу з Білою Церквою, де робили панелі. У сусідів таких висоток тоді не було! А ще тримайте крутий факт: у Бородянці реально планували запустити тролейбус. Уявіть, наскільки масштабно мислило тодішнє керівництво — тролейбусні лінії в селищі!\n",
    address: "Вулиця Велика 2, 4",
  },
  {
    lng: 29.937701,
    lat: 50.645195,
    title: "Торгове серце та старий храм",
    route: Route.HISTORICAL,
    desc:
      "1-6 – фото старих крамниць та майстерень, що були поруч\n" +
      "7 – список магазинів та майстерень Бородянки\n" +
      "8,9 – ярмарка в Бородянці\n" +
      "10,11 – стара СВято-Михайлівська церква\n" +
      "12 – радянський кінотеатр (не зберігся)\n" +
      "13 – чайна “Льонок” та згодом ресторан “Еврика”\n\n" +
      "Колись це місце було епіцентром життя. Уявіть: тут стукав молотком чоботар Овруцький, а поруч пахло свіжими продуктами з бакалійних крамниць. Потім настала ера прогресу — відкрився кінотеатр, і це стало справжнім культурним шоком для селища! Поряд працювала легендарна чайна «Льонок» — такий собі прототип «Пузатої хати», де завжди було людно (пізніше вона стала рестораном «Еврика»).\n\n" +
      "Але є й глибший шар: там, де зараз капличка на площі, колись велично стояла Свято-Михайлівська церква. А якщо пройти трохи далі, у бік сучасного АТБ та Литовсько-Українскього ліцею, ви потрапите на територію великої ярмаркової площі. \n\n" +
      "Значення / цікавий факт:\n\n" +
      "Ярмарки в Бородянці були подією регіонального масштабу. Вони відбувалися строго за календарем — від Різдва 7 січня (це за старим календарем) до Миколая в грудні. Це були дні, коли Бородянка перетворювалася на величезний вулик. Життя тут змінилося: від ремесел і торгівлі ми перейшли до культури та кінопрем’єр, але дух спільноти залишився.\n",
    address: "Вулиця Центральна, 248",
  },
  {
    lng: 29.938395,
    lat: 50.645157,
    title: "«Дзвін 90-х»",
    route: Route.HISTORICAL,
    desc:
      "У 1990 році Бородянка довела, що вона — за вільну Україну. Тут відбулася перша масова демонстрація з синьо-жовтими прапорами. Це був сміливий крок Народного Руху, який змінив атмосферу в усьому селищі.\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Ми обрали незалежність ще до того, як це стало офіційним фактом. Це місце нашої сили та національного пробудження.\n",
    images: [],
    address: "Центральний парк",
  },
  {
    lng: 29.939986,
    lat: 50.644539,
    title: "Синагога та єврейський квартал",
    route: Route.HISTORICAL,
    desc:
      "1 – Казначейсвто, де колись була синагога\n" +
      "2,3 – страі будинки на вулиці Шевченка\n" +
      "4,5 – гурто читання Тори в Бородянці\n" +
      "6,7 – Геня, Клара та Ліза Бродські єврейські дівчата у вишиванках\n" +
      "8,9 – Типові представники місцевого єврейства – власник млина, який був біля сучасного ставку, Хаїм Штикель з родиною, початок 20 століття. Хаїм помер під час евакуації в Казань в 1943, а його доньки Віра та Двора загинули в Бабиному Яру 1941\n" +
      "10 – надгробок на єврейському кладовищі на вулиці Єврейській\n\n" +
      "Вулиця Шевченка — це колишній єврейський квартал. Історія Бородянки була б неповною без єврейської громади, яка становила майже чверть населення (згідлно перепису наслення 1897 року). Тут вирувало життя: працювали майстерні, крамниці, банк та аптека. На місці теперішнього Казначейства з 1863 року стояла синагога, а поруч діти ходили до єврейської школи.\n\n" +
      "Наші народи жили пліч-о-пліч. Хоча 1920-ті роки принесли страшні погроми, у мирні часи культури тісно перепліталися. Наприклад, на старих фото можна побачити дівчат із родин Бродських у справжніх українських вишиванках — Геню, Клару та Лізу. Це був такий собі «Бородянський штетл», де традиції змішувалися.\n\n" +
      "Значення / цікавий факт:\n\n" +
      "За кожним прізвищем — історія. Хаїм Штикель, власник млина біля ставка, помер в евакуації, а його доньки Віра та Двора загинули в Бабиному Яру в 1941-му. Єдине, що залишилося від тієї громади фізично як артефакт — старе кладовище на вулиці Єврейській. Це нагадування про те, якою багатогранною була наша Бородянка.\n",
    address: "Вулиця Шевченка (будівля Казначейства)",
  },
  {
    lng: 29.94189,
    lat: 50.646876,
    title: "Маєток та відродження",
    route: Route.HISTORICAL,
    desc:
      "1,2 – вигляд старого Центру реабілітації ЮНЕСКО\n" +
      "3 – сучасний реабілітаційний центр\n" +
      "4 – вид згори, де яскраво зелене футбольне поле раніше був парк\n\n" +
      "У цієї будівлі дуже багато ролей: від дворянського маєтку до РАЦСу та бібліотеки. Але в 1994 році тут стався історичний поворот — відкрився Центр реабілітації ЮНЕСКО для «дітей Чорнобиля». Сьогодні тут продовжують рятувати душі, допомагаючи нашим військовим.\n\n" +
      "Що було поруч:\n\n" +
      "Навпроти був костел, а за будівлею — парк з атракціонами. Улюблене місце закоханих — бузковий гай та карусель «Ромашка» (зараз там футбольне поле ліцею).\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Найбільша втрата — унікальні дерев’яні сходи всередині маєтку. Вони пережили століття, але, на жаль, були знищені під час окупації 2022 року.\n",
    address: "Вулиця Центральна, 228",
  },
  {
    lng: 29.943505,
    lat: 50.646712,
    title: "Телеграф: голос громади",
    route: Route.HISTORICAL,
    desc:
      "Це місце було нашим вікном у світ. Тут працював телеграф, пошта і весь телефонний вузол району. Десятки тисяч розмов проходили через ці стіни. Саме сюди бігли, щоб почути голос рідних з іншого міста.\n\n" +
      "Значення / цікавий факт:\n\n" +
      "Ця будівля — технологічна колиска Бородянки. Саме тут, серед кабелів та телефонних станцій, імовірно, з’явився найперший інтернет у нашому селищі. Від паперового листа — до першого кліку!\n",
    address: "Будівля навпроти ліцею",
  },
  {
    lng: 29.933341,
    lat: 50.643284,
    title: "Фініш! Твій приз чекає",
    route: Route.HISTORICAL,
    desc:
      "Вітаємо! Ти пройшов маршрут Бородянкою, яку знають не всі. Ти бачив черепашок, уявляв тролейбуси та чув відлуння старих ярмарків. Селище — це не просто назва, це десятки таких історій.\n\n" +
      "**Твій наступний крок:**\n\n" +
      "Ти заслужив нагороду за свою цікавість! Завітай до Cake.shop 2, за адресою вулиця Центральна 355 та покажи цей екран та забирай свій приз. Дякуємо, що був з нами!\n",
    address: "Пункт видачі призів – кавʼярня Cake.shop 2.0",
  },
].map(giveId);

const INTERESTING_POINTS: MapPoint[] = [
  {
    lng: 29.95299844945745,
    lat: 50.65397555497733,
    title: "Test Point",
    route: Route.INTERESTING,
    desc: "Test Point Description",
    address: "Borodyanka, Street, 1",
  },

  {
    lng: 29.90382841473295,
    lat: 50.638188642254896,
    title: "2nd Test Point",
    route: Route.INTERESTING,
    desc: "Test Point Description",
    address: "Borodyanka, Street, 1",
  },

  {
    lng: 29.92821216309318,
    lat: 50.6402178840394,
    title: "2nd Test Point",
    route: Route.INTERESTING,
    desc: "Test Point Description",
    address: "Borodyanka, Street, 1",
  },
].map(giveId);

const MILITARY_POINTS: MapPoint[] = [
  {
    lng: 29.945383280739335,
    lat: 50.659150572205526,
    title: "Test Point",
    route: Route.MILITARY,
    desc: "Test Point Description",
    address: "Borodyanka, Street, 1",
  },

  {
    lng: 29.930117831737647,
    lat: 50.65629981895986,
    title: "2nd Test Point",
    route: Route.MILITARY,
    desc: "Test Point Description",
    address: "Borodyanka, Street, 1",
  },

  {
    lng: 29.94461409144855,
    lat: 50.64887204391916,
    title: "2nd Test Point",
    route: Route.MILITARY,
    desc: "Test Point Description",
    address: "Borodyanka, Street, 1",
  },
].map(giveId);

export const MAP_POINTS: Record<Route, MapPoint[]> = {
  [Route.HISTORICAL]: HISTORICAL_POINTS,
  [Route.INTERESTING]: INTERESTING_POINTS,
  [Route.MILITARY]: MILITARY_POINTS,
};

export const ROUTES_COLORS: Record<Route, string> = {
  [Route.HISTORICAL]: "#742195",
  [Route.INTERESTING]: "#efe539",
  [Route.MILITARY]: "#3b5727",
};

export const ROUTES_ICONS: Record<Route, string> = {
  [Route.HISTORICAL]: historyIcon,
  [Route.INTERESTING]: interestingIcon,
  [Route.MILITARY]: militaryIcon,
};

function giveId(p: MapPoint | Omit<MapPoint, "id" | "images">, i: number) {
  //@ts-ignore
  p.id = Math.random();
  //@ts-ignore
  p.images = POINTS_IMAGES[p.route][i] || [];
  return p as MapPoint;
}
